In [11]:
from datetime import datetime
import pandas as pd

In [3]:
now = datetime.now()
now

datetime.datetime(2023, 7, 16, 17, 45, 2, 863873)

In [4]:
# pandas will treat dates as "object" datatypes until converted to "datatime64"
#numPys datetime64 data type lets you work with datetimes in dataframes

In [ ]:
#.astype() method can convert strings to datetimes but has some limitations
# 1.any values that pandas cant correctly identify as dates will return an error

In [6]:
#to convert using .to_datetime()
#specify errors="coerce" to convert errors to NaT
#infer_datatime_format=True to let pandas intelligently guess the date format of the text strings
# format= to specify the datetime format if pandas cant guess correctly

In [7]:
now

datetime.datetime(2023, 7, 16, 17, 45, 2, 863873)

In [9]:
now.strftime("%B %d, %Y")

'July 16, 2023'

In [ ]:
#.dt accessor lets you use .strftime() on datetimes in Pandas

In [14]:
retail = pd.read_csv("../retail/retail.csv", parse_dates=["date"])
retail.head()

        id       date  store_nbr      family  sales  onpromotion
0  1945944 2016-01-01          1  AUTOMOTIVE    0.0            0
1  1945945 2016-01-01          1   BABY CARE    0.0            0
2  1945946 2016-01-01          1      BEAUTY    0.0            0
3  1945947 2016-01-01          1   BEVERAGES    0.0            0
4  1945948 2016-01-01          1       BOOKS    0.0            0

In [15]:
retail.info(memory_usage="deep")

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1054944 entries, 0 to 1054943
Data columns (total 6 columns):
 #   Column       Non-Null Count    Dtype
---  ------       --------------    -----
 0   id           1054944 non-null  int64
 1   date         1054944 non-null  datetime64[ns]
 2   store_nbr    1054944 non-null  int64
 3   family       1054944 non-null  object
 4   sales        1054944 non-null  float64
 5   onpromotion  1054944 non-null  int64
dtypes: datetime64[ns](1), float64(1), int64(3), object(1)
memory usage: 108.4 MB

In [19]:
retail["date"].dt.strftime("%y-%b, %d").head()

0    16-Jan, 01
1    16-Jan, 01
2    16-Jan, 01
3    16-Jan, 01
4    16-Jan, 01
Name: date, dtype: object

In [22]:
retail.assign(
    year=retail["date"].dt.dayofweek)

,id,date,store_nbr,family,sales,onpromotion,year
0,1945944,2016-01-01,1,AUTOMOTIVE,0.000,0,4
1,1945945,2016-01-01,1,BABY CARE,0.000,0,4
2,1945946,2016-01-01,1,BEAUTY,0.000,0,4
3,1945947,2016-01-01,1,BEVERAGES,0.000,0,4
4,1945948,2016-01-01,1,BOOKS,0.000,0,4
...,...,...,...,...,...,...,...
1054939,3000883,2017-08-15,9,POULTRY,438.133,0,1
1054940,3000884,2017-08-15,9,PREPARED FOODS,154.553,1,1
1054941,3000885,2017-08-15,9,PRODUCE,2419.729,148,1
1054942,3000886,2017-08-15,9,SCHOOL AND OFFICE SUPPLIES,121.000,8,1
1054943,3000887,2017-08-15,9,SEAFOOD,16.000,0,1